---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/miguelportela/Dropbox/1.miguel/1.formacao/jupyter/stata_full_exercise/logs/exercise_complete_output.txt
  log type:  text
 opened on:  17 Feb 2020, 08:27:31
r; t=0.00 8:27:31

. r; t=0.00 8:27:31
. `e7e163e2a876281286ea7f9dd85b0b7d'
r; t=0.00 8:27:31
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:31

. local `__user_rc' = _rc
r; t=0.00 8:27:31

. r; t=0.00 8:27:31
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:31
. _StataKernelLog off
r; t=0.00 8:27:31

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:31
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:31

. macro drop _`__user_rc'
r; t=0.00 8:27:31

. macro drop ___user_rc
r; t=0.00 8:27:31

. r; t=0.00 8:27:31
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:31
. include /Users/miguelportela/.stata_kernel_cache/include.do

. use ../data/income, clear
r; t=0.00 8:27:31

. describe

Contains data from ../data/income.dta
  obs:        11,340                          
 vars:            12                          24 Jan 2017 09:53
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country         str24   %24s                  Country name
year            int     %10.0g                Year of observation
isocode         str3    %9s                   Country code
pop             double  %10.0g                Population (in thousands)
xrat            double  %10.0g                Exchange Rate to US$; national currency units per US dollar
ppp             double  %10.0g                Purchasing Power Parity over GDP (in national currency units per US$)
rgdpl           double  %10.0g                PPP Converted GDP Per Capita (Laspeyres), derived from growth rates of c, g, i,
kc              double  %10.0g                Consumption Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl
kg              double  %10.0g                Government Consumption Share of PPP Converted GDP Per Capita at 2005 constant pr
ki              double  %10.0g                Investment Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl]
openk           double  %10.0g                Openness at 2005 constant prices (%)
rgdpwok         double  %10.0g                PPP Converted GDP Chain per worker at 2005 constant prices
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: country  year
r; t=0.00 8:27:31

. codebook, compact

Variable     Obs Unique      Mean        Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country    11340    189         .          .         .  Country name
year       11340     60    1979.5       1950      2009  Year of observation
isocode    11340    189         .          .         .  Country code
pop        11338  11244  23558.96      7.251   1323592  Population (in thousands)
xrat       10105   5225  1.39e+13   8.88e-23  1.40e+17  Exchange Rate to US$; national currency units per US dollar
ppp         8687   8614  111.7852   1.62e-14  40289.96  Purchasing Power Parity over GDP (in national currency units per US$)
rgdpl       8667   8667  8310.856   117.5953  159144.5  PPP Converted GDP Per Capita (Laspeyres), derived from growth rates of c, g, i,
kc          8667   8637  70.47317    3.65343  228.4698  Consumption Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl
kg          8667   8641  12.34453   .2766603  68.06395  Government Consumption Share of PPP Converted GDP Per Capita at 2005 constant pr
ki          8667   8644  22.92754  -33.14052  111.2905  Investment Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl]
openk       8667   8641  71.47224    1.03495  443.1754  Openness at 2005 constant prices (%)
rgdpwok     8120   8120   19156.2   320.2628  312988.9  PPP Converted GDP Chain per worker at 2005 constant prices
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=0.36 8:27:31

. inspect openk

openk:  Openness at 2005 constant prices        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive        8,667             -         8,667
|  #                                   -----------   -----------   -----------
|  #   #                     Total           8,667             -         8,667
|  #   #   .   .   .         Missing         2,673
+----------------------                -----------
1.03495        443.1754                     11,340
(More than 99 unique values)
r; t=0.00 8:27:31

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     country |          0
        year |     11,340      1979.5    17.31887       1950       2009
     isocode |          0
         pop |     11,338    23558.96    93734.63      7.251    1323592
        xrat |     10,105    1.39e+13    1.39e+15   8.88e-23   1.40e+17
-------------+---------------------------------------------------------
         ppp |      8,687    111.7852    887.4055   1.62e-14   40289.96
       rgdpl |      8,667    8310.856    10962.03   117.5953   159144.5
          kc |      8,667    70.47317    19.56573    3.65343   228.4698
          kg |      8,667    12.34453    9.138436   .2766603   68.06395
          ki |      8,667    22.92754    11.66376  -33.14052   111.2905
-------------+---------------------------------------------------------
       openk |      8,667    71.47224    49.25664    1.03495   443.1754
     rgdpwok |      8,120     19156.2    22874.07   320.2628   312988.9
r; t=0.14 8:27:31

. sum rgdpwok, detail

         PPP Converted GDP Chain per worker at 2005
                       constant prices
-------------------------------------------------------------
      Percentiles      Smallest
 1%      737.355       320.2628
 5%     1309.684       343.1598
10%     1739.604       396.4862       Obs               8,120
25%     3384.818       396.7613       Sum of Wgt.       8,120

50%     10823.27                      Mean            19156.2
                        Largest       Std. Dev.      22874.07
75%     26335.74       261832.4
90%     50387.09       268116.8       Variance       5.23e+08
95%     62486.57       271192.1       Skewness       2.896306
99%      91939.9       312988.9       Kurtosis       20.34334
r; t=0.02 8:27:31

. lookfor GDP

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ppp             double  %10.0g                Purchasing Power Parity over GDP (in national currency units per US$)
rgdpl           double  %10.0g                PPP Converted GDP Per Capita (Laspeyres), derived from growth rates of c, g, i,
kc              double  %10.0g                Consumption Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl
kg              double  %10.0g                Government Consumption Share of PPP Converted GDP Per Capita at 2005 constant pr
ki              double  %10.0g                Investment Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl]
rgdpwok         double  %10.0g                PPP Converted GDP Chain per worker at 2005 constant prices
r; t=0.00 8:27:31

. order isocode,before(year)
r; t=0.00 8:27:31

. des

Contains data from ../data/income.dta
  obs:        11,340                          
 vars:            12                          24 Jan 2017 09:53
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country         str24   %24s                  Country name
isocode         str3    %9s                   Country code
year            int     %10.0g                Year of observation
pop             double  %10.0g                Population (in thousands)
xrat            double  %10.0g                Exchange Rate to US$; national currency units per US dollar
ppp             double  %10.0g                Purchasing Power Parity over GDP (in national currency units per US$)
rgdpl           double  %10.0g                PPP Converted GDP Per Capita (Laspeyres), derived from growth rates of c, g, i,
kc              double  %10.0g                Consumption Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl
kg              double  %10.0g                Government Consumption Share of PPP Converted GDP Per Capita at 2005 constant pr
ki              double  %10.0g                Investment Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl]
openk           double  %10.0g                Openness at 2005 constant prices (%)
rgdpwok         double  %10.0g                PPP Converted GDP Chain per worker at 2005 constant prices
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: country  year
r; t=0.00 8:27:31

. list country isocode year in 1/10

     +------------------------------+
     |     country   isocode   year |
     |------------------------------|
  1. | afghanistan       AFG   1950 |
  2. | afghanistan       AFG   1951 |
  3. | afghanistan       AFG   1952 |
  4. | afghanistan       AFG   1953 |
  5. | afghanistan       AFG   1954 |
     |------------------------------|
  6. | afghanistan       AFG   1955 |
  7. | afghanistan       AFG   1956 |
  8. | afghanistan       AFG   1957 |
  9. | afghanistan       AFG   1958 |
 10. | afghanistan       AFG   1959 |
     +------------------------------+
r; t=0.00 8:27:31

. assert (year >= 1950 & year <= 2010)
r; t=0.01 8:27:31

. unique year
Number of unique values of year is  60
Number of records is  11340
r; t=0.08 8:27:32

. unique country
Number of unique values of country is  189
Number of records is  11340
r; t=0.02 8:27:32

. r; t=0.72 8:27:32
. `f14115ba3b39948066ba06a852815866'
r; t=0.00 8:27:32
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:32

. local `__user_rc' = _rc
r; t=0.00 8:27:32

. r; t=0.00 8:27:32
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:32
r; t=0.00 8:27:32

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:32
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:32

. macro drop _`__user_rc'
r; t=0.00 8:27:32

. macro drop ___user_rc
r; t=0.00 8:27:32

. r; t=0.00 8:27:32
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:32
. include /Users/miguelportela/.stata_kernel_cache/include.do

. use ../data/education, clear
r; t=0.00 8:27:32

. describe

Contains data from ../data/education.dta
  obs:         1,086                          
 vars:             3                          24 Jan 2017 09:53
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country         str31   %31s                  country
year            int     %10.0g                year
education       double  %10.0g                education
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: country  year
r; t=0.00 8:27:32

. codebook, compact

Variable    Obs Unique      Mean   Min    Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country    1086    142         .     .      .  country
year       1086     11  1978.992  1950   2000  year
education  1056    655  4.717775   .04  12.25  education
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=0.04 8:27:32

. inspect education

education:  education                           Number of Observations
---------------------                  ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #   #                     Zero                -             -             -
|  #   #   #                 Positive        1,056            11         1,045
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total           1,056            11         1,045
|  #   #   #   #   .         Missing            30
+----------------------                -----------
.04               12.25                      1,086
(More than 99 unique values)
r; t=0.00 8:27:32

. sum education, detail

                          education
-------------------------------------------------------------
      Percentiles      Smallest
 1%          .21            .04
 5%          .63            .07
10%          .99             .1       Obs               1,056
25%         2.24            .14       Sum of Wgt.       1,056

50%        4.365                      Mean           4.717775
                        Largest       Std. Dev.      2.949585
75%         7.13          11.91
90%         9.02             12       Variance        8.70005
95%         9.73          12.18       Skewness       .3549397
99%        11.43          12.25       Kurtosis        2.09657
r; t=0.02 8:27:32

. unique year
Number of unique values of year is  11
Number of records is  1086
r; t=0.02 8:27:32

. unique country
Number of unique values of country is  142
Number of records is  1086
r; t=0.02 8:27:32

. duplicates tag country,gen(dup)

Duplicates in terms of country
r; t=0.02 8:27:32

. tab dup

        dup |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         16        1.47        1.47
          1 |         10        0.92        2.39
          2 |         27        2.49        4.88
          3 |          4        0.37        5.25
          6 |         21        1.93        7.18
          7 |          8        0.74        7.92
          8 |        639       58.84       66.76
          9 |        350       32.23       98.99
         10 |         11        1.01      100.00
------------+-----------------------------------
      Total |      1,086      100.00
r; t=0.00 8:27:32

. list if dup == 0

      +-----------------------------------------+
      |         country   year   educat~n   dup |
      |-----------------------------------------|
  20. | antigua & barb.   1960        4.8     0 |
 137. |         burundi   1990       1.23     0 |
 295. |         estonia   1990       9.17     0 |
 296. |        ethiopia   1995       1.15     0 |
 530. |     kazakhastan   1990       9.03     0 |
      |-----------------------------------------|
 559. |          latvia   1990       9.54     0 |
 581. |       lithuania   1990        9.3     0 |
 619. |      mauritania   1990       1.94     0 |
 640. |         moldova   1990       9.07     0 |
 794. |      pueto rico   1990       9.14     0 |
      |-----------------------------------------|
 852. | solomon islands   1975       2.53     0 |
 884. | st.vincent & g.   1980       4.99     0 |
 940. |      tajikistan   1990       9.62     0 |
1005. | united arab em.   1975       2.88     0 |
1035. |         vanuatu   1980          .     0 |
      |-----------------------------------------|
1046. |        viet nam   1990       3.81     0 |
      +-----------------------------------------+
r; t=0.00 8:27:32

. drop dup
r; t=0.00 8:27:32

. tabstat education,by(country) stat(mean sd min p10 p50 p90 p99)

Summary for variables: education
     by categories of: country (country)

         country |      mean        sd       min       p10       p50       p90       p99
-----------------+----------------------------------------------------------------------
     afghanistan |  .9277778  .1591208       .73       .73       .91      1.14      1.14
         algeria |     1.975  1.438157       .65      .735     1.315     4.315      4.72
 antigua & barb. |       4.8         .       4.8       4.8       4.8       4.8       4.8
       argentina |     6.403  1.394673      4.36     4.675      6.25     8.305      8.49
       australia |  9.967778   .401428       9.3       9.3     10.06     10.57     10.57
         austria |  7.732222  .8443752      6.71      6.71      8.22       8.8       8.8
         bahrain |  3.386667  1.795355      1.37      1.37      3.12      6.09      6.09
      bangladesh |  1.572222  .6851966       .79       .79      1.68      2.45      2.45
        barbados |  7.653333  1.545971      5.22      5.22      8.19      9.11      9.11
         belgium |  8.125556  .4332179      7.46      7.46      8.16      8.73      8.73
          belize |         .         .         .         .         .         .         .
           benin |  1.127143   .736449       .29       .29       .89       2.1       2.1
         bolivia |  4.358889  .6501816      3.72      3.72      4.19      5.54      5.54
        botswana |  2.807778  1.572091      1.32      1.32      2.29      5.35      5.35
          brazil |  3.333333  .6671769      2.78      2.78      2.98      4.56      4.56
          brunei |  3.826667  1.817755      2.24      2.24      3.43      5.81      5.81
        bulgaria |     7.502  1.579309      5.06      5.57      7.19     9.625      9.74
         burundi |      1.23         .      1.23      1.23      1.23      1.23      1.23
        cameroon |  1.928889  .7041741      1.25      1.25      1.73      3.17      3.17
          canada |  9.835556  1.208833      8.07      8.07     10.23     11.43     11.43
 central afr. r. |  1.042222  .7343497       .38       .38       .74      2.11      2.11
           chile |     5.976   1.18996      4.41      4.59     5.755      7.71      7.89
           china |  4.601667  1.009305       3.4       3.4      4.69      5.74      5.74
        colombia |     3.686  .9366275      2.24     2.485      3.96     4.845      5.01
           congo |      3.42  1.073014      1.93      1.93     3.595      4.68      4.68
      costa rica |     4.658  .9486107       3.5     3.555      4.59     5.915      6.01
         croatia |  6.253333  .2510644      5.99      5.99      6.28      6.49      6.49
            cuba |     5.506  1.575924      3.63      3.64     5.505     7.595      7.78
          cyprus |  6.712222  1.813179      4.29      4.29      6.53      8.77      8.77
           czech |      9.38    .08544      9.29      9.29      9.39      9.46      9.46
  czechoslovakia |  8.681429  1.167482      7.17      7.17      8.73     10.35     10.35
         denmark |  9.355556  .5410432      8.78      8.78      9.16     10.13     10.13
        dominica |      4.27  .3818377         4         4      4.27      4.54      4.54
  dominican rep. |  3.571111  1.040738      2.27      2.27      3.36      5.17      5.17
         ecuador |     4.509  1.575997      2.36     2.655     4.695     6.385      6.52
           egypt |      3.22  1.358381      1.32      1.32      3.25      5.05      5.05
     el salvador |     2.863  1.061896      1.42      1.56     2.935     4.275       4.5
         estonia |      9.17         .      9.17      9.17      9.17      9.17      9.17
        ethiopia |      1.15         .      1.15      1.15      1.15      1.15      1.15
            fiji |  6.198889  1.280619      4.67      4.67      6.01      7.96      7.96
         finland |  7.844444  1.755855      5.37      5.37      7.95     10.14     10.14
          france |  6.836667   .994799      5.78      5.78      6.77      8.37      8.37
          gambia |  1.038333  .5190536        .5        .5      .905      1.86      1.86
   germany, east |  9.297143  .7548005      8.59      8.59       8.8     10.17     10.17
 germany, united |       9.6  .1374773      9.48      9.48      9.57      9.75      9.75
   germany, west |  8.425714  .4601035      7.73      7.73      8.28      9.06      9.06
           ghana |  2.442222  1.173475       .69       .69      2.35      4.01      4.01
          greece |      6.19  1.599611      3.72      4.18     6.115      8.28      8.51
       guatemala |     2.046  .6841572      1.21      1.32     1.975     2.955      3.12
          guyana |  4.741111  .9142817       3.5       3.5      4.71      6.05      6.05
           haiti |     1.525  .8427633       .56       .63      1.26     2.615      2.67
        honduras |  2.744444  1.037571      1.67      1.67      2.33      4.08      4.08
       hong kong |  6.868889  1.886475      4.74      4.74      6.73      9.47      9.47
         hungary |  8.055556  .7873708      6.65      6.65       8.2      8.81      8.81
         iceland |  7.123333  1.108163      5.63      5.63      7.11      8.75      8.75
           india |  2.851111  1.179984      1.45      1.45      2.72      4.77      4.77
       indonesia |      2.89  1.196004      1.11      1.11      3.09      4.71      4.71
   iran, i.r. of |     2.102  1.492558       .46      .545      1.71      4.32      4.66
            iraq |  2.045556  1.532646       .21       .21      1.83      4.34      4.34
         ireland |  7.544444  1.055286      6.45      6.45       7.6      9.02      9.02
          israel |     8.123  1.088271      6.53     6.645     8.435      9.17      9.23
           italy |     5.474  .9175475      4.07     4.315       5.3       6.8         7
         jamaica |  3.751111   1.01402      2.46      2.46       3.6      5.22      5.22
           japan |     8.113  1.072764      6.87     6.875     7.955      9.58      9.72
          jordan |  3.816667  2.125841       1.4       1.4      2.93      7.37      7.37
     kazakhastan |      9.03         .      9.03      9.03      9.03      9.03      9.03
           kenya |  2.298889  1.032757      1.19      1.19      2.38      3.99      3.99
           korea |     6.613  2.732923      3.23     3.265      6.29    10.275     10.46
          kuwait |  4.451111  1.813722      2.41      2.41      4.29      7.05      7.05
          latvia |      9.54         .      9.54      9.54      9.54      9.54      9.54
         lesotho |  3.635556  .5343012      3.05      3.05      3.54      4.47      4.47
         liberia |  1.387778  .6700705       .56       .56      1.31      2.27      2.27
           libya |  1.616667  1.143562       .63       .63      1.35      2.87      2.87
       lithuania |       9.3         .       9.3       9.3       9.3       9.3       9.3
          malawi |  2.216667  .4405111       1.6       1.6      2.41       2.6       2.6
        malaysia |  4.688889  2.031283      2.34      2.34      4.49      7.88      7.88
            mali |  .4088889  .2358201       .17       .17       .37       .76       .76
           malta |     5.916  1.102272      3.79      4.46      5.74     7.345      7.57
      mauritania |      1.94         .      1.94      1.94      1.94      1.94      1.94
       mauritius |      3.98  1.237084      2.19     2.315     4.075     5.445      5.55
          mexico |     4.153   1.66067      2.32     2.365      3.75      6.55      6.73
         moldova |      9.07         .      9.07      9.07      9.07      9.07      9.07
      mozambique |  .6266667  .3213643       .26       .26       .53      1.19      1.19
 myanmar (burma) |     1.513  .6264015       .92      .945      1.18     2.365      2.44
         namibia |         .         .         .         .         .         .         .
           nepal |  .6922222  .6940781       .04       .04       .61      1.94      1.94
     netherlands |       7.7  1.399643      5.27      5.27      7.99      9.24      9.24
     new zealand |     10.69   .946269      9.36      9.36     11.18     11.52     11.52
       nicaragua |     2.924  .8945415      1.52     1.805      2.77     4.215      4.42
           niger |  .4211111  .2318644       .16       .16       .39       .82       .82
          norway |      8.73  2.248194      6.11      6.11      8.28     11.86     11.86
        pakistan |  1.726667    .62522       .63       .63      1.74      2.45      2.45
          panama |     5.643  1.588109      3.59      3.87      5.37       7.8       7.9
 papua new guin. |  1.342222   .599787       .58       .58      1.13      2.39      2.39
        paraguay |     4.359  1.161029      2.54      2.92     4.285      5.76      5.78
            peru |  5.025556   1.59107      3.02      3.02      5.44      7.33      7.33
     philippines |  5.331818  1.741981      2.42       3.5      5.46      7.33      7.62
          poland |  8.441111  1.189364      6.74      6.74      8.65       9.9       9.9
        portugal |  3.336667  1.073848      1.94      1.94      3.27      4.91      4.91
      pueto rico |      9.14         .      9.14      9.14      9.14      9.14      9.14
         reunion |      2.28         .      2.28      2.28      2.28      2.28      2.28
         romania |     7.077  1.877102      4.14     4.735     7.215     9.425      9.51
          rwanda |  1.357143  .4440613       .76       .76      1.35      2.03      2.03
         senegal |  1.802222  .3275201      1.24      1.24      1.92      2.23      2.23
      seychelles |      4.33  1.356024      3.11      3.11      4.09      5.79      5.79
    sierra leone |  1.003333  .5439669        .5        .5       .83      1.99      1.99
       singapore |  4.902222  1.882504      3.14      3.14      4.34      8.12      8.12
        slovakia |  9.083333  .1006645      8.99      8.99      9.07      9.19      9.19
        slovenia |  7.163333  .2074448      6.94      6.94       7.2      7.35      7.35
 solomon islands |      2.53         .      2.53      2.53      2.53      2.53      2.53
    south africa |  5.315556   1.57635      3.76      3.76      4.82      8.07      8.07
           spain |  5.222222  1.241156      3.64      3.64      5.15      7.25      7.25
       sri lanka |  4.728889  .9469879      3.43      3.43      5.18      6.09      6.09
 st.kitts& nevis |      7.65         .      7.65      7.65      7.65      7.65      7.65
        st.lucia |      4.22         .      4.22      4.22      4.22      4.22      4.22
 st.vincent & g. |      4.99         .      4.99      4.99      4.99      4.99      4.99
           sudan |       .81  .5992217       .27       .28       .56     1.765      1.91
       swaziland |  3.534444  1.598305      1.71      1.71      3.12      5.73      5.73
          sweden |  9.118889  1.469783      7.47      7.47      9.22     11.36     11.36
     switzerland |      9.07  1.267152       7.3       7.3       9.9     10.39     10.39
           syria |  3.096667  1.721003       .99       .99      2.86      5.74      5.74
          taiwan |  5.976667  1.904613      3.32      3.32      6.37      8.53      8.53
      tajikistan |      9.62         .      9.62      9.62      9.62      9.62      9.62
        thailand |      4.38  1.119498      3.15      3.15      3.77       6.1       6.1
            togo |  1.461111  1.025176       .32       .32      1.62      2.83      2.83
 trinidad & tob. |  5.831111  1.323239      4.19      4.19      6.38      7.62      7.62
         tunisia |  2.067778  1.328465       .54       .54      1.92       4.2       4.2
          turkey |     2.897  1.240135         1       1.5      2.53     4.685       4.8
        u.s.s.r. |  9.226667  1.030801      7.59      7.59      8.94     10.52     10.52
          uganda |  1.782222  .7639335      1.05      1.05      1.66      2.95      2.95
 united arab em. |      2.88         .      2.88      2.88      2.88      2.88      2.88
  united kingdom |     8.156   .729234      7.17     7.245      8.09      9.19      9.35
   united states |     10.57  1.625628      7.94       8.3     10.86    12.215     12.25
         uruguay |      5.98  .8846327      4.78      4.78      5.75      7.25      7.25
         vanuatu |         .         .         .         .         .         .         .
       venezuela |     3.939  1.403847      2.01      2.24     4.135      5.48      5.61
        viet nam |      3.81         .      3.81      3.81      3.81      3.81      3.81
   western samoa |  6.273333  .3347138      6.01      6.01      6.16      6.65      6.65
      yugoslavia |   5.91375  .9760553      4.96      4.96     5.535      7.48      7.48
           zaire |     1.533  .9988888       .41      .485     1.255     3.085      3.18
          zambia |  3.276667  1.530711       1.6       1.6      3.22      5.56      5.56
        zimbabwe |  2.926667   1.25108      1.54      1.54      2.82      4.88      4.88
-----------------+----------------------------------------------------------------------
           Total |  4.717775  2.949585       .04       .99     4.365      9.02     11.43
----------------------------------------------------------------------------------------
r; t=0.16 8:27:32

. logout, save(tabstat_education_country) excel word replace: tabstat education,by(country) stat(mean sd min p10 p50 p90 p99)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/miguelportela/Dropbox/1.miguel/1.formacao/jupyter/stata_full_exercise/logs/exercise_complete_output.txt
  log type:  text
 opened on:  17 Feb 2020, 08:27:32
r; t=0.00 8:27:32

. r; t=0.83 8:27:32
. `ae28f5075f42886c912d5a37a7c109df'
r; t=0.00 8:27:32
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:32

. local `__user_rc' = _rc
r; t=0.00 8:27:32

. r; t=0.00 8:27:32
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:32
r; t=0.00 8:27:33

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:33

. macro drop _`__user_rc'
r; t=0.00 8:27:33

. macro drop ___user_rc
r; t=0.00 8:27:33

. r; t=0.00 8:27:33
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. use ../data/capital, clear
r; t=0.00 8:27:33

. describe

Contains data from ../data/capital.dta
  obs:            63                          
 vars:            46                          24 Jan 2017 09:53
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country         str23   %23s                  
k1948           str10   %10s                  
k1949           str10   %10s                  
k1950           str17   %17s                  
k1951           str17   %17s                  
k1952           str17   %17s                  
k1953           str17   %17s                  
k1954           str17   %17s                  
k1955           str17   %17s                  
k1956           str17   %17s                  
k1957           str16   %16s                  
k1958           str17   %17s                  
k1959           str17   %17s                  
k1960           str17   %17s                  
k1961           str17   %17s                  
k1962           str17   %17s                  
k1963           str17   %17s                  
k1964           str17   %17s                  
k1965           str17   %17s                  
k1966           str17   %17s                  
k1967           str17   %17s                  
k1968           str17   %17s                  
k1969           str17   %17s                  
k1970           str17   %17s                  
k1971           str17   %17s                  
k1972           str17   %17s                  
k1973           str17   %17s                  
k1974           str17   %17s                  
k1975           str17   %17s                  
k1976           str17   %17s                  
k1977           str17   %17s                  
k1978           str17   %17s                  
k1979           str17   %17s                  
k1980           str17   %17s                  
k1981           str17   %17s                  
k1982           str17   %17s                  
k1983           str17   %17s                  
k1984           str17   %17s                  
k1985           str17   %17s                  
k1986           str17   %17s                  
k1987           str17   %17s                  
k1988           str17   %17s                  
k1989           str17   %17s                  
k1990           str17   %17s                  
k1991           str17   %17s                  
k1992           str17   %17s                  
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
r; t=0.01 8:27:33

. reshape long k,i(country) j(year)
(note: j = 1948 1949 1950 1951 1952 1953 1954 1955 1956 1957 1958 1959 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       63   ->    2835
Number of variables                  46   ->       3
j variable (45 values)                    ->   year
xij variables:
                  k1948 k1949 ... k1992   ->   k
-----------------------------------------------------------------------------
r; t=0.15 8:27:33

. describe

Contains data
  obs:         2,835                          
 vars:             3                          
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country         str23   %23s                  
year            int     %10.0g                
k               str17   %17s                  
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: country  year
     Note: Dataset has changed since last saved.
r; t=0.00 8:27:33

. destring k, replace force 
k: all characters numeric; replaced as double
(1356 missing values generated)
r; t=0.09 8:27:33

. rename k capital
r; t=0.00 8:27:33

. label var capital "Total capital per country"
r; t=0.00 8:27:33

. codebook, compact

Variable    Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country    2835     63         .         .         .  
year       2835     45      1970      1948      1992  
capital    1479   1479  4.79e+11  1.19e+09  1.45e+13  Total capital per country
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=0.03 8:27:33

. inspect capital

capital:  Total capital per country             Number of Observations
-----------------------------------    ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive        1,479             -         1,479
|  #                                   -----------   -----------   -----------
|  #                         Total           1,479             -         1,479
|  #   .   .   .   .         Missing         1,356
+----------------------                -----------
1.19e+09       1.45e+13                      2,835
(More than 99 unique values)
r; t=0.00 8:27:33

. sum capital, detail

                  Total capital per country
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.82e+09       1.19e+09
 5%     4.43e+09       1.21e+09
10%     8.10e+09       1.23e+09       Obs               1,479
25%     1.79e+10       1.26e+09       Sum of Wgt.       1,479

50%     8.06e+10                      Mean           4.79e+11
                        Largest       Std. Dev.      1.49e+12
75%     2.78e+11       1.12e+13
90%     7.76e+11       1.12e+13       Variance       2.22e+24
95%     1.89e+12       1.12e+13       Skewness       5.555904
99%     1.02e+13       1.45e+13       Kurtosis       36.36059
r; t=0.00 8:27:33

. unique year
Number of unique values of year is  45
Number of records is  2835
r; t=0.00 8:27:33

. unique country
Number of unique values of country is  63
Number of records is  2835
r; t=0.01 8:27:33

. sort country year
r; t=0.00 8:27:33

. preserve
r; t=0.00 8:27:33

. drop if capital == . 
(1,356 observations deleted)
r; t=0.00 8:27:33

. list in 1/10

     +------------------------------+
     |   country   year     capital |
     |------------------------------|
  1. | argentina   1967   1.762e+11 |
  2. | argentina   1968   1.914e+11 |
  3. | argentina   1969   2.018e+11 |
  4. | argentina   1970   1.987e+11 |
  5. | argentina   1971   2.150e+11 |
     |------------------------------|
  6. | argentina   1972   2.208e+11 |
  7. | argentina   1973   3.007e+11 |
  8. | argentina   1974   3.640e+11 |
  9. | argentina   1975   2.574e+11 |
 10. | argentina   1976   2.543e+11 |
     +------------------------------+
r; t=0.00 8:27:33

. tab country

                country |      Freq.     Percent        Cum.
------------------------+-----------------------------------
              argentina |         26        1.76        1.76
              australia |         26        1.76        3.52
                austria |         26        1.76        5.27
     belgium-luxembourg |         26        1.76        7.03
                 canada |         26        1.76        8.79
                  chile |         26        1.76       10.55
               colombia |         26        1.76       12.31
             costa rica |         26        1.76       14.06
                 cyprus |         26        1.76       15.82
czechoslovakia (former) |         26        1.76       17.58
                denmark |         26        1.76       19.34
     dominican republic |         26        1.76       21.10
                  egypt |         26        1.76       22.85
            el salvador |         26        1.76       24.61
                finland |         26        1.76       26.37
                 france |         26        1.76       28.13
                 greece |         26        1.76       29.89
              guatemala |         26        1.76       31.64
               honduras |         26        1.76       33.40
                  india |         26        1.76       35.16
              indonesia |         26        1.76       36.92
                   iran |         26        1.76       38.67
                   iraq |         26        1.76       40.43
                ireland |         26        1.76       42.19
                 israel |         26        1.76       43.95
                  italy |         26        1.76       45.71
                jamaica |         26        1.76       47.46
                  japan |         26        1.76       49.22
                  kenya |         26        1.76       50.98
             madagascar |         26        1.76       52.74
                 malawi |         26        1.76       54.50
                  malta |         26        1.76       56.25
              mauritius |         26        1.76       58.01
                morocco |         26        1.76       59.77
            netherlands |         26        1.76       61.53
            new zealand |         26        1.76       63.29
                 norway |         26        1.76       65.04
               pakistan |         26        1.76       66.80
                   peru |         23        1.56       68.36
            philippines |         26        1.76       70.11
                 poland |         26        1.76       71.87
               portugal |         26        1.76       73.63
           south africa |         26        1.76       75.39
            south korea |         26        1.76       77.15
              sri lanka |         26        1.76       78.90
                 sweden |         26        1.76       80.66
                  syria |         26        1.76       82.42
          taiwan, china |         26        1.76       84.18
               tanzania |         26        1.76       85.94
      trinidad & tobago |         26        1.76       87.69
                tunisia |         26        1.76       89.45
                 turkey |         26        1.76       91.21
         united kingdom |         26        1.76       92.97
          united states |         26        1.76       94.73
                uruguay |         26        1.76       96.48
              venezuela |         26        1.76       98.24
               zimbabwe |         26        1.76      100.00
------------------------+-----------------------------------
                  Total |      1,479      100.00
r; t=0.02 8:27:33

. restore
r; t=0.00 8:27:33

. save ../data/data_capital_long, replace
file ../data/data_capital_long.dta saved
r; t=0.00 8:27:33

. r; t=0.33 8:27:33
. `ea3619d50cfcf98eb6c6ee8b36c1599e'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:33

. local `__user_rc' = _rc
r; t=0.00 8:27:33

. r; t=0.00 8:27:33
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:33
r; t=0.00 8:27:33

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:33

. macro drop _`__user_rc'
r; t=0.00 8:27:33

. macro drop ___user_rc
r; t=0.00 8:27:33

. r; t=0.00 8:27:33
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. use ../data/income
r; t=0.00 8:27:33

. merge 1:1 country year using ../data/education
(note: variable country was str24, now str31 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,568
        from master                    10,411  (_merge==1)
        from using                        157  (_merge==2)

    matched                               929  (_merge==3)
    -----------------------------------------
r; t=0.02 8:27:33

. drop _merge
r; t=0.00 8:27:33

. merge 1:1 country year using ../data/data_capital_long

    Result                           # of obs.
    -----------------------------------------
    not matched                         9,430
        from master                     9,046  (_merge==1)
        from using                        384  (_merge==2)

    matched                             2,451  (_merge==3)
    -----------------------------------------
r; t=0.03 8:27:33

. drop _merge
r; t=0.00 8:27:33

. egen rmiss = rowmiss(rgdpwok education)
r; t=0.01 8:27:33

. tab rmiss

      rmiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        857        7.21        7.21
          1 |      7,462       62.81       70.02
          2 |      3,562       29.98      100.00
------------+-----------------------------------
      Total |     11,881      100.00
r; t=0.00 8:27:33

. keep if rmiss == 0
(11,024 observations deleted)
r; t=0.00 8:27:33

. drop rmiss
r; t=0.00 8:27:33

. save ../data/data_full, replace
file ../data/data_full.dta saved
r; t=0.00 8:27:33

. saveold ../data/data_full_stata_version13, replace version(13)
(saving in Stata 13 format)
file ../data/data_full_stata_version13.dta saved
r; t=0.00 8:27:33

. r; t=0.08 8:27:33
. `ebbd5176d85bdd54401854387516b35f'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:33

. local `__user_rc' = _rc
r; t=0.00 8:27:33

. r; t=0.00 8:27:33
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:33
r; t=0.00 8:27:33

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:33

. macro drop _`__user_rc'
r; t=0.00 8:27:33

. macro drop ___user_rc
r; t=0.00 8:27:33

. r; t=0.00 8:27:33
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:33
. include /Users/miguelportela/.stata_kernel_cache/include.do

. use ../data/data_full, clear
r; t=0.00 8:27:33

. describe

Contains data from ../data/data_full.dta
  obs:           857                          
 vars:            14                          17 Feb 2020 08:27
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country         str31   %31s                  Country name
year            int     %10.0g                Year of observation
isocode         str3    %9s                   Country code
pop             double  %10.0g                Population (in thousands)
xrat            double  %10.0g                Exchange Rate to US$; national currency units per US dollar
ppp             double  %10.0g                Purchasing Power Parity over GDP (in national currency units per US$)
rgdpl           double  %10.0g                PPP Converted GDP Per Capita (Laspeyres), derived from growth rates of c, g, i,
kc              double  %10.0g                Consumption Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl
kg              double  %10.0g                Government Consumption Share of PPP Converted GDP Per Capita at 2005 constant pr
ki              double  %10.0g                Investment Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl]
openk           double  %10.0g                Openness at 2005 constant prices (%)
rgdpwok         double  %10.0g                PPP Converted GDP Chain per worker at 2005 constant prices
education       double  %10.0g                education
capital         double  %10.0g                Total capital per country
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
r; t=0.01 8:27:33

. codebook, compact

Variable   Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country    857    106         .         .         .  Country name
year       857     11  1980.268      1950      2000  Year of observation
isocode    857    106         .         .         .  Country code
pop        857    857  35817.99    41.662   1263638  Population (in thousands)
xrat       857    617  80.60393  6.80e-14  8421.775  Exchange Rate to US$; national currency units per US dollar
ppp        857    848  37.18301  6.51e-14  2420.972  Purchasing Power Parity over GDP (in national currency units per US$)
rgdpl      857    857  8366.004   156.134  99462.73  PPP Converted GDP Per Capita (Laspeyres), derived from growth rates of c, g, i,
kc         857    857  71.87285  5.099385  189.4834  Consumption Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl
kg         857    857  9.894385  .2877948  43.33043  Government Consumption Share of PPP Converted GDP Per Capita at 2005 constant pr
ki         857    857   23.0355  1.446131  111.2905  Investment Share of PPP Converted GDP Per Capita at 2005 constant prices [rgdpl]
openk      857    857  62.85651  2.319838  395.9767  Openness at 2005 constant prices (%)
rgdpwok    857    857  19901.78  396.7613  271192.1  PPP Converted GDP Chain per worker at 2005 constant prices
education  857    583   4.76902       .04     12.25  education
capital    234    234  5.50e+11  1.19e+09  1.12e+13  Total capital per country
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=0.13 8:27:33

. inspect rgdpwok education capital

rgdpwok:  PPP Converted GDP Chain per wo        Number of Observations
-------------------------------------------------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive          857             1           856
|  #                                   -----------   -----------   -----------
|  #                         Total             857             1           856
|  #   .   .   .   .         Missing             -
+----------------------                -----------
396.7613       271192.1                        857
(More than 99 unique values)

education:  education                           Number of Observations
---------------------                  ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|  #   #                     Zero                -             -             -
|  #   #   #                 Positive          857             9           848
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total             857             9           848
|  #   #   #   #   #         Missing             -
+----------------------                -----------
.04               12.25                        857
(More than 99 unique values)

capital:  Total capital per country             Number of Observations
-----------------------------------    ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive          234             -           234
|  #                                   -----------   -----------   -----------
|  #                         Total             234             -           234
|  #   .   .   .   .         Missing           623
+----------------------                -----------
1.19e+09       1.12e+13                        857
(More than 99 unique values)
r; t=0.01 8:27:33

. tab country year if year >= 1990 & year <= 2000

                      |       Year of observation
         Country name |      1990       1995       2000 |     Total
----------------------+---------------------------------+----------
          afghanistan |         1          1          1 |         3 
              algeria |         1          1          1 |         3 
            argentina |         1          1          1 |         3 
            australia |         1          1          1 |         3 
              austria |         1          1          1 |         3 
              bahrain |         1          1          1 |         3 
           bangladesh |         1          1          1 |         3 
             barbados |         1          1          1 |         3 
              belgium |         1          1          1 |         3 
                benin |         1          1          1 |         3 
              bolivia |         1          1          1 |         3 
             botswana |         1          1          1 |         3 
               brazil |         1          1          1 |         3 
             bulgaria |         1          1          1 |         3 
              burundi |         1          0          0 |         1 
             cameroon |         1          1          1 |         3 
               canada |         1          1          1 |         3 
                chile |         1          1          1 |         3 
                china |         1          1          1 |         3 
             colombia |         1          1          1 |         3 
           costa rica |         1          1          1 |         3 
              croatia |         1          1          1 |         3 
                 cuba |         1          1          1 |         3 
               cyprus |         1          1          1 |         3 
              denmark |         1          1          1 |         3 
              ecuador |         1          1          1 |         3 
                egypt |         1          1          1 |         3 
          el salvador |         1          1          1 |         3 
              estonia |         1          0          0 |         1 
             ethiopia |         0          1          0 |         1 
                 fiji |         1          1          1 |         3 
              finland |         1          1          1 |         3 
               france |         1          1          1 |         3 
                ghana |         1          1          1 |         3 
               greece |         1          1          1 |         3 
            guatemala |         1          1          1 |         3 
               guyana |         1          1          1 |         3 
                haiti |         1          1          1 |         3 
             honduras |         1          1          1 |         3 
            hong kong |         1          1          1 |         3 
              hungary |         1          1          1 |         3 
              iceland |         1          1          1 |         3 
                india |         1          1          1 |         3 
            indonesia |         1          1          1 |         3 
                 iraq |         1          1          1 |         3 
              ireland |         1          1          1 |         3 
               israel |         1          1          1 |         3 
                italy |         1          1          1 |         3 
              jamaica |         1          1          1 |         3 
                japan |         1          1          1 |         3 
               jordan |         1          1          1 |         3 
                kenya |         1          1          1 |         3 
               kuwait |         1          1          1 |         3 
              lesotho |         1          1          1 |         3 
              liberia |         1          1          1 |         3 
               malawi |         1          1          1 |         3 
             malaysia |         1          1          1 |         3 
                 mali |         1          1          1 |         3 
                malta |         1          1          1 |         3 
           mauritania |         1          0          0 |         1 
            mauritius |         1          1          1 |         3 
               mexico |         1          1          1 |         3 
           mozambique |         1          1          1 |         3 
                nepal |         1          1          1 |         3 
          netherlands |         1          1          1 |         3 
          new zealand |         1          1          1 |         3 
            nicaragua |         1          1          1 |         3 
                niger |         1          1          1 |         3 
               norway |         1          1          1 |         3 
             pakistan |         1          1          1 |         3 
               panama |         1          1          1 |         3 
             paraguay |         1          1          1 |         3 
                 peru |         1          1          1 |         3 
          philippines |         1          1          1 |         3 
               poland |         1          1          1 |         3 
             portugal |         1          1          1 |         3 
              romania |         1          1          1 |         3 
               rwanda |         1          1          1 |         3 
              senegal |         1          1          1 |         3 
         sierra leone |         1          1          1 |         3 
            singapore |         1          1          1 |         3 
             slovenia |         1          1          1 |         3 
         south africa |         1          1          1 |         3 
                spain |         1          1          1 |         3 
            sri lanka |         1          1          1 |         3 
                sudan |         1          1          1 |         3 
            swaziland |         1          1          1 |         3 
               sweden |         1          1          1 |         3 
          switzerland |         1          1          1 |         3 
                syria |         1          1          1 |         3 
               taiwan |         1          1          1 |         3 
             thailand |         1          1          1 |         3 
                 togo |         1          1          1 |         3 
              tunisia |         1          1          1 |         3 
               turkey |         1          1          1 |         3 
               uganda |         1          1          1 |         3 
       united kingdom |         1          1          1 |         3 
        united states |         1          1          1 |         3 
              uruguay |         1          1          1 |         3 
            venezuela |         1          1          1 |         3 
               zambia |         1          1          1 |         3 
             zimbabwe |         1          1          1 |         3 
----------------------+---------------------------------+----------
                Total |       101         99         98 |       298 
r; t=0.04 8:27:33

. tab country year if year >= 1990 & year <= 2000,sum(education)

          Means, Standard Deviations and Frequencies of education

                                |      Year of observation
                   Country name |      1990       1995       2000 |     Total
--------------------------------+---------------------------------+----------
                    afghanistan |       .91       1.13       1.14 |      1.06
                                |         0          0          0 |       .13
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        algeria |      3.01       3.91       4.72 |      3.88
                                |         0          0          0 | .85539465
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      argentina |      7.77       8.12       8.49 | 8.1266667
                                |         0          0          0 | .36004629
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      australia |     10.12      10.31      10.57 | 10.333333
                                |         0          0          0 | .22590558
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        austria |      8.22       8.44        8.8 | 8.4866667
                                |         0          0          0 | .29280255
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        bahrain |      4.87       5.57       6.09 |      5.51
                                |         0          0          0 | .61220911
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                     bangladesh |      2.19       2.32       2.45 |      2.32
                                |         0          0          0 |       .13
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       barbados |      8.19       8.72       9.11 | 8.6733333
                                |         0          0          0 | .46177195
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        belgium |      8.43       8.55       8.73 |      8.57
                                |         0          0          0 | .15099669
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          benin |      1.56       1.95        2.1 |      1.87
                                |         0          0          0 |  .2787472
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        bolivia |      4.74       5.18       5.54 | 5.1533333
                                |         0          0          0 | .40066611
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       botswana |       4.2        4.7       5.35 |      4.75
                                |         0          0          0 | .57662813
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         brazil |      3.76       4.17       4.56 | 4.1633333
                                |         0          0          0 | .40004166
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       bulgaria |      9.26       9.51       9.74 | 9.5033333
                                |         0          0          0 | .24006943
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        burundi |      1.23          .          . |      1.23
                                |         0          .          . |         0
                                |         1          0          0 |         1
--------------------------------+---------------------------------+----------
                       cameroon |      2.39       2.75       3.17 |      2.77
                                |         0          0          0 | .39038443
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         canada |      10.5      11.18      11.43 | 11.036667
                                |         0          0          0 | .48128301
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          chile |      7.14       7.53       7.89 |      7.52
                                |         0          0          0 | .37509999
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          china |      5.23       5.48       5.74 | 5.4833333
                                |         0          0          0 | .25501634
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       colombia |      4.37       4.68       5.01 | 4.6866667
                                |         0          0          0 | .32005208
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                     costa rica |      5.57       5.82       6.01 |       5.8
                                |         0          0          0 | .22068076
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        croatia |      5.99       6.28       6.49 | 6.2533333
                                |         0          0          0 |  .2510644
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                           cuba |       6.8       7.41       7.78 |      7.33
                                |         0          0          0 | .49487372
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         cyprus |      8.41        8.6       8.77 | 8.5933333
                                |         0          0          0 | .18009257
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        denmark |     10.13       9.86      10.09 | 10.026667
                                |         0          0          0 | .14571662
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        ecuador |      5.94       6.25       6.52 | 6.2366667
                                |         0          0          0 | .29022979
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          egypt |      3.57       4.24       5.05 | 4.2866667
                                |         0          0          0 | .74110278
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                    el salvador |      3.58       4.05        4.5 | 4.0433333
                                |         0          0          0 | .46003623
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        estonia |      9.17          .          . |      9.17
                                |         0          .          . |         0
                                |         1          0          0 |         1
--------------------------------+---------------------------------+----------
                       ethiopia |         .       1.15          . |      1.15
                                |         .          0          . |         0
                                |         0          1          0 |         1
--------------------------------+---------------------------------+----------
                           fiji |      7.42       7.68       7.96 | 7.6866667
                                |         0          0          0 | .27006172
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        finland |      9.48       9.82      10.14 | 9.8133333
                                |         0          0          0 |  .3300505
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         france |      7.56       7.94       8.37 | 7.9566667
                                |         0          0          0 | .40525712
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          ghana |      3.34       3.75       4.01 |       3.7
                                |         0          0          0 | .33778692
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         greece |      7.66       8.05       8.51 | 8.0733333
                                |         0          0          0 | .42548012
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      guatemala |       2.6       2.79       3.12 | 2.8366667
                                |         0          0          0 | .26312228
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         guyana |      5.43       5.81       6.05 | 5.7633333
                                |         0          0          0 | .31262331
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          haiti |      2.36       2.56       2.67 |      2.53
                                |         0          0          0 | .15716234
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       honduras |      3.69       3.89       4.08 | 3.8866667
                                |         0          0          0 | .19502137
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      hong kong |      8.37       9.33       9.47 | 9.0566667
                                |         0          0          0 | .59877653
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        hungary |      8.71       8.52       8.81 |      8.68
                                |         0          0          0 |  .1473092
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        iceland |      7.96       8.35       8.75 | 8.3533333
                                |         0          0          0 | .39501055
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          india |      3.68       4.16       4.77 | 4.2033333
                                |         0          0          0 | .54629052
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      indonesia |       3.3       4.03       4.71 | 4.0133333
                                |         0          0          0 | .70514774
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                           iraq |       3.2          4       4.34 | 3.8466667
                                |         0          0          0 | .58526347
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        ireland |       8.5       8.79       9.02 |      8.77
                                |         0          0          0 | .26057628
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         israel |      9.03       9.06       9.23 | 9.1066667
                                |         0          0          0 | .10785793
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          italy |      6.16        6.6          7 | 6.5866667
                                |         0          0          0 |  .4201587
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        jamaica |      4.55       4.92       5.22 | 4.8966667
                                |         0          0          0 |  .3356089
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          japan |      9.22       9.44       9.72 |      9.46
                                |         0          0          0 | .25059928
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         jordan |      5.39       6.42       7.37 | 6.3933333
                                |         0          0          0 | .99026932
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          kenya |      2.98        3.5       3.99 |      3.49
                                |         0          0          0 | .50507425
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         kuwait |      5.99       6.54       7.05 | 6.5266667
                                |         0          0          0 | .53012577
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        lesotho |      4.12       4.25       4.47 |      4.28
                                |         0          0          0 | .17691806
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        liberia |      1.94       2.27       2.26 | 2.1566667
                                |         0          0          0 | .18770544
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         malawi |      2.58        2.6       2.58 | 2.5866667
                                |         0          0          0 | .01154701
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       malaysia |      5.54       7.65       7.88 | 7.0233333
                                |         0          0          0 | 1.2897416
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                           mali |       .61        .69        .76 | .68666667
                                |         0          0          0 | .07505553
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          malta |      6.77       7.12       7.57 | 7.1533333
                                |         0          0          0 | .40104031
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                     mauritania |      1.94          .          . |      1.94
                                |         0          .          . |         0
                                |         1          0          0 |         1
--------------------------------+---------------------------------+----------
                      mauritius |      5.15       5.34       5.55 | 5.3466667
                                |         0          0          0 | .20008332
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         mexico |      5.87       6.37       6.73 | 6.3233333
                                |         0          0          0 | .43189505
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                     mozambique |       .84       1.01       1.19 | 1.0133333
                                |         0          0          0 | .17502381
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          nepal |      1.03       1.53       1.94 |       1.5
                                |         0          0          0 | .45574115
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                    netherlands |      8.61       8.96       9.24 | 8.9366667
                                |         0          0          0 | .31564748
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                    new zealand |     11.18      11.31      11.52 | 11.336667
                                |         0          0          0 | .17156146
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      nicaragua |       3.6       4.01       4.42 |      4.01
                                |         0          0          0 |       .41
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          niger |       .55        .69        .82 | .68666667
                                |         0          0          0 | .13503086
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         norway |     10.85      11.82      11.86 |     11.51
                                |         0          0          0 | .57192657
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       pakistan |      2.29       2.38       2.45 | 2.3733333
                                |         0          0          0 | .08020806
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         panama |      7.31        7.7        7.9 | 7.6366667
                                |         0          0          0 | .30005555
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       paraguay |      5.78       5.73       5.74 |      5.75
                                |         0          0          0 | .02645751
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                           peru |      5.92       6.92       7.33 | 6.7233333
                                |         0          0          0 | .72528155
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                    philippines |      7.07       7.33       7.62 |      7.34
                                |         0          0          0 | .27513633
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         poland |       9.6       9.73        9.9 | 9.7433333
                                |         0          0          0 | .15044379
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       portugal |      4.33       4.54       4.91 | 4.5933333
                                |         0          0          0 | .29365513
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        romania |      9.24       9.34       9.51 | 9.3633333
                                |         0          0          0 | .13650397
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         rwanda |      1.49       1.76       2.03 |      1.76
                                |         0          0          0 |       .27
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        senegal |      1.97       2.05       2.23 | 2.0833333
                                |         0          0          0 | .13316656
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                   sierra leone |      1.32       1.65       1.99 | 1.6533333
                                |         0          0          0 | .33501244
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      singapore |      5.52       7.82       8.12 | 7.1533333
                                |         0          0          0 | 1.4224392
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       slovenia |      6.94        7.2       7.35 | 7.1633333
                                |         0          0          0 | .20744477
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                   south africa |      5.14       8.07       7.87 | 7.0266667
                                |         0          0          0 | 1.6369586
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          spain |      6.09       6.62       7.25 | 6.6533333
                                |         0          0          0 | .58071795
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      sri lanka |      5.26       5.61       6.09 | 5.6533333
                                |         0          0          0 | .41669333
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          sudan |      1.26       1.62       1.91 | 1.5966667
                                |         0          0          0 |  .3256276
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      swaziland |      4.85       5.38       5.73 |      5.32
                                |         0          0          0 | .44305756
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         sweden |      9.57      11.23      11.36 |     10.72
                                |         0          0          0 |  .9980481
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                    switzerland |      9.92      10.18      10.39 | 10.163333
                                |         0          0          0 | .23544285
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          syria |      4.35       5.21       5.74 |       5.1
                                |         0          0          0 |  .7014984
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         taiwan |      7.44       8.03       8.53 |         8
                                |         0          0          0 | .54561891
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       thailand |      5.35       5.73        6.1 | 5.7266667
                                |         0          0          0 | .37501111
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                           togo |      2.34       2.67       2.83 | 2.6133333
                                |         0          0          0 | .24986663
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        tunisia |      3.02       3.58        4.2 |       3.6
                                |         0          0          0 | .59025418
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         turkey |      3.95       4.57        4.8 |      4.44
                                |         0          0          0 | .43965896
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         uganda |      2.58        2.7       2.95 | 2.7433333
                                |         0          0          0 | .18876794
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                 united kingdom |      8.74       9.03       9.35 |      9.04
                                |         0          0          0 | .30512293
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                  united states |        12      12.18      12.25 | 12.143333
                                |         0          0          0 | .12897028
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                        uruguay |      6.69       6.88       7.25 |      6.94
                                |         0          0          0 | .28478062
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                      venezuela |      4.89       5.35       5.61 | 5.2833333
                                |         0          0          0 | .36460024
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                         zambia |      4.09       5.56       5.43 | 5.0266667
                                |         0          0          0 |  .8137772
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                       zimbabwe |      4.09       4.43       4.88 | 4.4666667
                                |         0          0          0 | .39627432
                                |         1          1          1 |         3
--------------------------------+---------------------------------+----------
                          Total | 5.4991089  5.9415152  6.2917347 |  5.906745
                                | 2.8518163  2.8763218  2.8437057 | 2.8662062
                                |       101         99         98 |       298
r; t=0.19 8:27:34

. r; t=0.41 8:27:34
. `939989290adc3e0cd50a80e3bb347b8a'
r; t=0.00 8:27:34
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:34

. local `__user_rc' = _rc
r; t=0.00 8:27:34

. r; t=0.00 8:27:34
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:34
r; t=0.00 8:27:34

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:34
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:34

. macro drop _`__user_rc'
r; t=0.00 8:27:34

. macro drop ___user_rc
r; t=0.00 8:27:34

. r; t=0.00 8:27:34
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:34
. include /Users/miguelportela/.stata_kernel_cache/include.do

. generate lngdp = ln(rgdpwok)
r; t=0.00 8:27:34

. ge lnk = ln(capital)
(623 missing values generated)
r; t=0.00 8:27:34

. label var rgdpwok "Real GDP per worker"
r; t=0.00 8:27:34

. label var education "Education (in years)"
r; t=0.00 8:27:34

. label var capital "Capital"
r; t=0.00 8:27:34

. label var open "Degree of openness"
r; t=0.00 8:27:34

. sum open, detail

                     Degree of openness
-------------------------------------------------------------
      Percentiles      Smallest
 1%     7.768206       2.319838
 5%     12.96987       2.330925
10%     18.77767       2.514998       Obs                 857
25%     29.91408       3.540735       Sum of Wgt.         857

50%     49.19247                      Mean           62.85651
                        Largest       Std. Dev.      52.17845
75%     75.60732        335.939
90%     126.0015       346.3693       Variance       2722.591
95%     159.1463       393.9669       Skewness       2.484958
99%     290.2023       395.9767       Kurtosis       11.98879
r; t=0.00 8:27:34

. return list

scalars:
                  r(N) =  857
              r(sum_w) =  857
               r(mean) =  62.85651003354628
                r(Var) =  2722.591043507821
                 r(sd) =  52.17845382442663
           r(skewness) =  2.484958465750417
           r(kurtosis) =  11.98878775859081
                r(sum) =  53868.02909874916
                r(min) =  2.31983757019043
                r(max) =  395.9767150878906
                 r(p1) =  7.768206119537354
                 r(p5) =  12.96987438201904
                r(p10) =  18.77766609191895
                r(p25) =  29.91408348083496
                r(p50) =  49.19247436523438
                r(p75) =  75.60731506347656
                r(p90) =  126.0014801025391
                r(p95) =  159.1463470458984
                r(p99) =  290.2023315429688
r; t=0.00 8:27:34

. format %5.2f open
r; t=0.00 8:27:34

. l open in 1/10

     +--------+
     |  openk |
     |--------|
  1. |  11.40 |
  2. |  25.60 |
  3. |  24.59 |
  4. |  24.61 |
  5. |  24.58 |
     |--------|
  6. |  64.78 |
  7. |  71.77 |
  8. | 154.19 |
  9. |  85.40 |
 10. |  89.47 |
     +--------+
r; t=0.00 8:27:34

. format %5.3f open
r; t=0.00 8:27:34

. sum open

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       openk |        857    62.85651    52.17845   2.319838   395.9767
r; t=0.02 8:27:34

. sum open, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       openk |        857      62.857      52.178      2.320    395.977
r; t=0.01 8:27:34

. gen high_open = (open > r(p50) & open ~= .)
r; t=0.00 8:27:34

. label define lbl_openh 0 "Low openness"  1 "High openness"
r; t=0.00 8:27:34

. label values high_open lbl_openh
r; t=0.00 8:27:34

. tab high_open

    high_open |      Freq.     Percent        Cum.
--------------+-----------------------------------
 Low openness |        857      100.00      100.00
--------------+-----------------------------------
        Total |        857      100.00
r; t=0.00 8:27:34

. clonevar high_open_tmp = high_open
r; t=0.00 8:27:34

. recode high_open_tmp 0 = 10 1 = 20
(high_open_tmp: 857 changes made)
r; t=0.02 8:27:34

. tab high_open_tmp

high_open_tmp |      Freq.     Percent        Cum.
--------------+-----------------------------------
           10 |        857      100.00      100.00
--------------+-----------------------------------
        Total |        857      100.00
r; t=0.00 8:27:34

. drop high_open_tmp
r; t=0.00 8:27:34

. encode country, gen(country_n)
r; t=0.00 8:27:34

. tab country_n if high_open == 1
no observations
r; t=0.00 8:27:34

. tab country_n if high_open == 1, nolabel
no observations
r; t=0.00 8:27:34

. label dir
country_n
lbl_openh
r; t=0.00 8:27:34

. label list country_n
country_n:
           1 afghanistan
           2 algeria
           3 argentina
           4 australia
           5 austria
           6 bahrain
           7 bangladesh
           8 barbados
           9 belgium
          10 benin
          11 bolivia
          12 botswana
          13 brazil
          14 brunei
          15 bulgaria
          16 burundi
          17 cameroon
          18 canada
          19 chile
          20 china
          21 colombia
          22 costa rica
          23 croatia
          24 cuba
          25 cyprus
          26 denmark
          27 dominica
          28 ecuador
          29 egypt
          30 el salvador
          31 estonia
          32 ethiopia
          33 fiji
          34 finland
          35 france
          36 ghana
          37 greece
          38 guatemala
          39 guyana
          40 haiti
          41 honduras
          42 hong kong
          43 hungary
          44 iceland
          45 india
          46 indonesia
          47 iraq
          48 ireland
          49 israel
          50 italy
          51 jamaica
          52 japan
          53 jordan
          54 kenya
          55 kuwait
          56 lesotho
          57 liberia
          58 malawi
          59 malaysia
          60 mali
          61 malta
          62 mauritania
          63 mauritius
          64 mexico
          65 mozambique
          66 nepal
          67 netherlands
          68 new zealand
          69 nicaragua
          70 niger
          71 norway
          72 pakistan
          73 panama
          74 paraguay
          75 peru
          76 philippines
          77 poland
          78 portugal
          79 romania
          80 rwanda
          81 senegal
          82 seychelles
          83 sierra leone
          84 singapore
          85 slovenia
          86 solomon islands
          87 south africa
          88 spain
          89 sri lanka
          90 sudan
          91 swaziland
          92 sweden
          93 switzerland
          94 syria
          95 taiwan
          96 thailand
          97 togo
          98 tunisia
          99 turkey
         100 uganda
         101 united kingdom
         102 united states
         103 uruguay
         104 venezuela
         105 zambia
         106 zimbabwe
r; t=0.02 8:27:34

. bysort country: gen nobs_1 = _N
r; t=0.00 8:27:34

. egen nobs_2 = count(year),by(country)
r; t=0.02 8:27:34

. compare nobs_1 nobs_2

                                        ---------- difference ----------
                            count       minimum      average     maximum
------------------------------------------------------------------------
nobs_1=nobs_2                 857
                       ----------
jointly defined               857             0            0           0
                       ----------
total                         857
r; t=0.03 8:27:34

. drop nobs*
r; t=0.00 8:27:34

. foreach nn of numlist 1985(5)2000 {
  2. display _new _new "YEAR: `nn'" _new
  3. preserve
  4. keep if year == `nn'
  5. tabstat education,by(high_open) stat(mean sd p10 p50 p90 p99)
  6. restore
  7. }


YEAR: 1985

(761 observations deleted)

Summary for variables: education
     by categories of: high_open 

    high_open |      mean        sd       p10       p50       p90       p99
--------------+------------------------------------------------------------
 Low openness |  4.999792  2.769477      1.59     4.755      8.51     11.71
--------------+------------------------------------------------------------
        Total |  4.999792  2.769477      1.59     4.755      8.51     11.71
---------------------------------------------------------------------------


YEAR: 1990

(756 observations deleted)

Summary for variables: education
     by categories of: high_open 

    high_open |      mean        sd       p10       p50       p90       p99
--------------+------------------------------------------------------------
 Low openness |  5.499109  2.851816      1.94      5.35      9.26     11.18
--------------+------------------------------------------------------------
        Total |  5.499109  2.851816      1.94      5.35      9.26     11.18
---------------------------------------------------------------------------


YEAR: 1995

(758 observations deleted)

Summary for variables: education
     by categories of: high_open 

    high_open |      mean        sd       p10       p50       p90       p99
--------------+------------------------------------------------------------
 Low openness |  5.941515  2.876322      1.95      5.73      9.73     12.18
--------------+------------------------------------------------------------
        Total |  5.941515  2.876322      1.95      5.73      9.73     12.18
---------------------------------------------------------------------------


YEAR: 2000

(759 observations deleted)

Summary for variables: education
     by categories of: high_open 

    high_open |      mean        sd       p10       p50       p90       p99
--------------+------------------------------------------------------------
 Low openness |  6.291735  2.843706      2.23      6.09       9.9     12.25
--------------+------------------------------------------------------------
        Total |  6.291735  2.843706      2.23      6.09       9.9     12.25
---------------------------------------------------------------------------
r; t=0.02 8:27:34

. replace country = proper(country) 
(857 real changes made)
r; t=0.00 8:27:34

. preserve
r; t=0.00 8:27:34

. contract country
r; t=0.00 8:27:34

. drop _freq
r; t=0.00 8:27:34

. list in 1/10

     +-------------+
     |     country |
     |-------------|
  1. | Afghanistan |
  2. |     Algeria |
  3. |   Argentina |
  4. |   Australia |
  5. |     Austria |
     |-------------|
  6. |     Bahrain |
  7. |  Bangladesh |
  8. |    Barbados |
  9. |     Belgium |
 10. |       Benin |
     +-------------+
r; t=0.00 8:27:34

. restore
r; t=0.00 8:27:34

. replace country = regexr(country,"Spain","Espanha")
(9 real changes made)
r; t=0.00 8:27:34

. local cc = "Portugal Espanha"
r; t=0.00 8:27:34

. foreach asd of local cc {
  2. di _new _new "COUNTRY:`asd'" _new
  3. preserve
  4. keep if country == "`asd'"
  5. sum education if year >= 1990, detail
  6. restore
  7. }


COUNTRY:Portugal

(848 observations deleted)

                    Education (in years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%         4.33           4.33
 5%         4.33           4.54
10%         4.33           4.91       Obs                   3
25%         4.33              .       Sum of Wgt.           3

50%         4.54                      Mean           4.593333
                        Largest       Std. Dev.      .2936551
75%         4.91              .
90%         4.91           4.33       Variance       .0862333
95%         4.91           4.54       Skewness       .3226495
99%         4.91           4.91       Kurtosis            1.5


COUNTRY:Espanha

(848 observations deleted)

                    Education (in years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%         6.09           6.09
 5%         6.09           6.62
10%         6.09           7.25       Obs                   3
25%         6.09              .       Sum of Wgt.           3

50%         6.62                      Mean           6.653333
                        Largest       Std. Dev.      .5807179
75%         7.25              .
90%         7.25           6.09       Variance       .3372333
95%         7.25           6.62       Skewness       .1051035
99%         7.25           7.25       Kurtosis            1.5
r; t=0.01 8:27:34

. preserve
r; t=0.00 8:27:34

. collapse (mean) lngdp education,by(country)
r; t=0.02 8:27:34

. count
  106
r; t=0.00 8:27:34

. codebook, compact

Variable   Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
country    106    106         .         .         .  Country name
lngdp      106    106  9.271266  6.707485  12.32974  (mean) lngdp
education  106    106  4.697735  .4088889     10.69  (mean) education
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=0.00 8:27:34

. cap noi scatter lngdp education || lfit lngdp education, scheme(economist)
r; t=2.15 8:27:36

. if _rc == 0 {
.     noi gr export /Users/miguelportela/.stata_kernel_cache/graph$stata_kernel_graph_counter.svg, width(600) replace
(file /Users/miguelportela/.stata_kernel_cache/graph2.svg written in SVG format)
r; t=0.00 8:27:36
.     noi gr export /Users/miguelportela/.stata_kernel_cache/graph$stata_kernel_graph_counter.pdf, replace
(file /Users/miguelportela/.stata_kernel_cache/graph2.pdf written in PDF format)
r; t=0.01 8:27:36
.     global stata_kernel_graph_counter = $stata_kernel_graph_counter + 1
r; t=0.00 8:27:36
. }            
r; t=0.02 8:27:36

. restore
r; t=0.00 8:27:36

. gsort -country +year
r; t=0.12 8:27:36

. list country year in 1/20

     +------------------+
     |   country   year |
     |------------------|
  1. |  Zimbabwe   1960 |
  2. |  Zimbabwe   1965 |
  3. |  Zimbabwe   1970 |
  4. |  Zimbabwe   1975 |
  5. |  Zimbabwe   1980 |
     |------------------|
  6. |  Zimbabwe   1985 |
  7. |  Zimbabwe   1990 |
  8. |  Zimbabwe   1995 |
  9. |  Zimbabwe   2000 |
 10. |    Zambia   1960 |
     |------------------|
 11. |    Zambia   1965 |
 12. |    Zambia   1970 |
 13. |    Zambia   1975 |
 14. |    Zambia   1980 |
 15. |    Zambia   1985 |
     |------------------|
 16. |    Zambia   1990 |
 17. |    Zambia   1995 |
 18. |    Zambia   2000 |
 19. | Venezuela   1950 |
 20. | Venezuela   1960 |
     +------------------+
r; t=0.00 8:27:36

. sort country year
r; t=0.03 8:27:36

. list country year if _n <15

     +--------------------+
     |     country   year |
     |--------------------|
  1. | Afghanistan   1970 |
  2. | Afghanistan   1975 |
  3. | Afghanistan   1980 |
  4. | Afghanistan   1985 |
  5. | Afghanistan   1990 |
     |--------------------|
  6. | Afghanistan   1995 |
  7. | Afghanistan   2000 |
  8. |     Algeria   1960 |
  9. |     Algeria   1965 |
 10. |     Algeria   1970 |
     |--------------------|
 11. |     Algeria   1975 |
 12. |     Algeria   1980 |
 13. |     Algeria   1985 |
 14. |     Algeria   1990 |
     +--------------------+
r; t=0.00 8:27:36

. bysort country (year): gen delta_gdp = lngdp - lngdp[_n - 1]
(106 missing values generated)
r; t=0.02 8:27:37

. list country year lngdp delta_gdp in 1/15

     +-------------------------------------------+
     |     country   year      lngdp   delta_gdp |
     |-------------------------------------------|
  1. | Afghanistan   1970   7.853122           . |
  2. | Afghanistan   1975   7.853979    .0008569 |
  3. | Afghanistan   1980   7.805802   -.0481772 |
  4. | Afghanistan   1985   8.019671    .2138696 |
  5. | Afghanistan   1990   7.701018   -.3186536 |
     |-------------------------------------------|
  6. | Afghanistan   1995   7.263443   -.4375753 |
  7. | Afghanistan   2000    7.11216   -.1512828 |
  8. |     Algeria   1960   9.563566           . |
  9. |     Algeria   1965   9.460362   -.1032038 |
 10. |     Algeria   1970   9.729613    .2692509 |
     |-------------------------------------------|
 11. |     Algeria   1975   9.733677    .0040636 |
 12. |     Algeria   1980   9.900827    .1671505 |
 13. |     Algeria   1985   9.948037    .0472097 |
 14. |     Algeria   1990   9.789332   -.1587048 |
 15. |     Algeria   1995   9.563859   -.2254734 |
     +-------------------------------------------+
r; t=0.00 8:27:37

. r; t=2.60 8:27:37
. `ac149de5deece1f73ad400430ad9f80d'
r; t=0.00 8:27:37
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:37

. local `__user_rc' = _rc
r; t=0.00 8:27:37

. r; t=0.00 8:27:37
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:37
r; t=0.00 8:27:37

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:37
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:37

. macro drop _`__user_rc'
r; t=0.00 8:27:37

. macro drop ___user_rc
r; t=0.00 8:27:37

. r; t=0.00 8:27:37
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:37
. include /Users/miguelportela/.stata_kernel_cache/include.do

. replace capital = capital/1000000
(234 real changes made)
r; t=0.00 8:27:37

. preserve
r; t=0.00 8:27:37

.     keep rgdpwok education capital open
r; t=0.00 8:27:37

.     order rgdpwok education capital open
r; t=0.00 8:27:37

.     outreg2 using ../text/summary_statistics_table.doc, auto(4) sum(detail) word tex eqkeep(N mean p99 sd min max) dec(3) replace label

                     Real GDP per worker
-------------------------------------------------------------
      Percentiles      Smallest
 1%      820.097       396.7613
 5%     1470.394       680.4185
10%     1967.046       688.3165       Obs                 857
25%     4362.333       689.6256       Sum of Wgt.         857

50%     12840.54                      Mean           19901.78
                        Largest       Std. Dev.      21470.14
75%     30059.78       85669.11
90%     49808.75       96111.57       Variance       4.61e+08
95%     58815.88         188886       Skewness       3.177364
99%     74706.38       271192.1       Kurtosis       28.43526

                    Education (in years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%          .19            .04
 5%          .69            .07
10%         1.14             .1       Obs                 857
25%         2.34            .14       Sum of Wgt.         857

50%         4.49                      Mean            4.76902
                        Largest       Std. Dev.      2.881695
75%         7.05          11.91
90%         8.81             12       Variance       8.304164
95%         9.73          12.18       Skewness       .3636891
99%        11.43          12.25       Kurtosis       2.202767

                           Capital
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1844.198       1194.622
 5%     3174.852       1549.717
10%     8474.061       1844.198       Obs                 234
25%      18616.5       2102.596       Sum of Wgt.         234

50%     87715.94                      Mean           549819.6
                        Largest       Std. Dev.       1582298
75%     301942.1        9160030
90%      1138605       1.02e+07       Variance       2.50e+12
95%      2622523       1.05e+07       Skewness       4.914161
99%     1.02e+07       1.12e+07       Kurtosis       28.59741

                     Degree of openness
-------------------------------------------------------------
      Percentiles      Smallest
 1%     7.768206       2.319838
 5%     12.96987       2.330925
10%     18.77767       2.514998       Obs                 857
25%     29.91408       3.540735       Sum of Wgt.         857

50%     49.19247                      Mean           62.85651
                        Largest       Std. Dev.      52.17845
75%     75.60732        335.939
90%     126.0015       346.3693       Variance       2722.591
95%     159.1463       393.9669       Skewness       2.484958
99%     290.2023       395.9767       Kurtosis       11.98879


../text/summary_statistics_table.tex
../text/summary_statistics_table.doc
dir : seeout
r; t=0.93 8:27:38

. restore
r; t=0.00 8:27:38

. r; t=0.94 8:27:38
. `70056ee55bc3cea83f3d7ba6d61a8e0f'
r; t=0.00 8:27:38
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:38

. local `__user_rc' = _rc
r; t=0.00 8:27:38

. r; t=0.00 8:27:38
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:38
r; t=0.00 8:27:38

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:38
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:38

. macro drop _`__user_rc'
r; t=0.00 8:27:38

. macro drop ___user_rc
r; t=0.00 8:27:38

. r; t=0.00 8:27:38
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:38
. include /Users/miguelportela/.stata_kernel_cache/include.do

. logout, save(tabstat_education_country) tex replace: tabstat education,by(country) stat(mean sd min p5 p50 p90 p99)

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/miguelportela/Dropbox/1.miguel/1.formacao/jupyter/stata_full_exercise/logs/exercise_complete_output.txt
  log type:  text
 opened on:  17 Feb 2020, 08:27:38
r; t=0.00 8:27:38

. r; t=0.35 8:27:38
. `629b06f8acd99cfe68d0102e1a361928'
r; t=0.00 8:27:38
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:38

. local `__user_rc' = _rc
r; t=0.00 8:27:38

. r; t=0.00 8:27:38
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:38
r; t=0.00 8:27:38

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:38
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:38

. macro drop _`__user_rc'
r; t=0.00 8:27:38

. macro drop ___user_rc
r; t=0.00 8:27:38

. r; t=0.00 8:27:38
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:38
. include /Users/miguelportela/.stata_kernel_cache/include.do

. label var year "Year"
r; t=0.00 8:27:38

. tabout year using ../text/summary_statistics_2.tex, cells(N pop mean pop mean openk mean rgdpwok mean education mean lngdp median lnk median delta_gdp) sum style(tex) replace ptotal(single) oneway f(0c 1c 1c 1c 1c 1p 1c 2p) h1(nil) h2( & & \multicolumn{
> 5}{c}{Means} & \multicolumn{2}{|c}{Medians} \\ \hline) h3(& Obs. & Pop. & OpenK & GDP & Education & ln GDP & ln Capital & $\Delta_{GDP}$ \\) botf() botstr("Source: own computations.")

Table output written to: ../text/summary_statistics_2.tex

& & \multicolumn{5}{c}{Means} & \multicolumn{2}{|c}{Medians} \\ \hline
& Obs. & Pop. & OpenK & GDP & Education & ln GDP & ln Capital & $\Delta_{GDP}$ \\
\hline
Year&&&&&&&& \\
1950&16&27,877.8&35.5&10,744.6&3.4&9.1\%&& \\
1955&2&13,162.5&49.0&9,727.7&5.0&8.8\%&&0.28\% \\
1960&78&21,242.5&49.5&11,999.7&3.6&8.9\%&&0.24\% \\
1965&79&23,208.5&51.2&14,346.9&3.6&9.1\%&&0.18\% \\
1970&95&22,366.0&58.4&18,371.2&3.9&9.2\%&24.7&0.16\% \\
1975&96&34,289.6&59.0&18,179.0&4.1&9.3\%&25.0&0.11\% \\
1980&97&36,974.5&64.6&23,061.3&4.7&9.4\%&25.3&0.12\% \\
1985&96&40,684.6&61.6&20,407.0&5.0&9.4\%&25.2&0.01\% \\
1990&101&42,267.4&66.5&21,947.4&5.5&9.4\%&25.5&0.06\% \\
1995&99&46,936.5&73.8&23,535.4&5.9&9.4\%&&0.03\% \\
2000&98&50,089.0&80.4&26,142.1&6.3&9.5\%&&0.07\% \\
\hline
Total&857&35,818.0&62.9&19,901.8&4.8&9.3\%&25.2&0.09\% \\
r; t=0.23 8:27:39

. r; t=0.24 8:27:39
. `aa96d94cc99aeec00f90be05b2a3f1c1'
r; t=0.00 8:27:39
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:39

. local `__user_rc' = _rc
r; t=0.00 8:27:39

. r; t=0.00 8:27:39
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:39
r; t=0.00 8:27:39

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:39
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:39

. macro drop _`__user_rc'
r; t=0.00 8:27:39

. macro drop ___user_rc
r; t=0.00 8:27:39

. r; t=0.00 8:27:39
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:39
. cap noi twoway (kdensity lngdp if year == 1970) || (kdensity lngdp if year == 1990, lpattern(dash_dot_dot)), legend(label(1 "Year: 1960") label(2 "Year: 2000") region(lwidth(none))) title(Income: 1960 vs. 2000) xtitle("Log (Income)") ytitle("Density") s
> cheme(sj) graphregion(color(white)) bgcolor(white)
r; t=1.00 8:27:40

. if _rc == 0 {
.     noi gr export /Users/miguelportela/.stata_kernel_cache/graph$stata_kernel_graph_counter.svg, width(600) replace
(file /Users/miguelportela/.stata_kernel_cache/graph3.svg written in SVG format)
r; t=0.00 8:27:40
.     noi gr export /Users/miguelportela/.stata_kernel_cache/graph$stata_kernel_graph_counter.pdf, replace
(file /Users/miguelportela/.stata_kernel_cache/graph3.pdf written in PDF format)
r; t=0.00 8:27:40
.     global stata_kernel_graph_counter = $stata_kernel_graph_counter + 1
r; t=0.00 8:27:40
. }            
r; t=0.02 8:27:40

. `eaca4c54c007910f2e99bf29fbbb60d0'
r; t=0.00 8:27:40
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:40

. local `__user_rc' = _rc
r; t=0.00 8:27:40

. r; t=0.00 8:27:40
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:40
r; t=0.00 8:27:40

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:40
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:40

. macro drop _`__user_rc'
r; t=0.00 8:27:40

. macro drop ___user_rc
r; t=0.00 8:27:40

. r; t=0.00 8:27:40
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:40
. include /Users/miguelportela/.stata_kernel_cache/include.do

. sum education if year == 2000,detail

                    Education (in years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%          .76            .76
 5%         1.91            .82
10%         2.23           1.14       Obs                  98
25%         4.42           1.19       Sum of Wgt.          98

50%         6.09                      Mean           6.291735
                        Largest       Std. Dev.      2.843706
75%         8.53          11.43
90%          9.9          11.52       Variance       8.086662
95%        11.36          11.86       Skewness      -.0281713
99%        12.25          12.25       Kurtosis       2.172931
r; t=0.00 8:27:40

. global a = r(p50)
r; t=0.00 8:27:40

. global b = r(p10)
r; t=0.00 8:27:40

. local c = r(p90)
r; t=0.00 8:27:40

. cap noi graph dot (mean) education if (country == "Denmark" | country == "Portugal" | country == "United States" | country == "Italy" | country == "Spain"),over(country, sort((max) lngdp)) title("Maximum level of education between 1960 and 2000", span) 
> note("Notes: Countries are ordered by maximum GDP." "Values in the axis are percentiles 10, 50 and 90 of education, respectively, in 2000.") ytitle("Education") yline($a $b `c') ylabel($a $b `c',format(%3.1g)) graphregion(color(white)) bgcolor(white) sc
> heme(s2color)
r; t=1.27 8:27:41

. if _rc == 0 {
.     noi gr export /Users/miguelportela/.stata_kernel_cache/graph$stata_kernel_graph_counter.svg, width(600) replace
(file /Users/miguelportela/.stata_kernel_cache/graph4.svg written in SVG format)
r; t=0.02 8:27:41
.     noi gr export /Users/miguelportela/.stata_kernel_cache/graph$stata_kernel_graph_counter.pdf, replace
(file /Users/miguelportela/.stata_kernel_cache/graph4.pdf written in PDF format)
r; t=0.03 8:27:41
.     global stata_kernel_graph_counter = $stata_kernel_graph_counter + 1
r; t=0.00 8:27:41
. }            
r; t=0.06 8:27:41

. graph export ../text/example1.eps, replace
(file ../text/example1.eps written in EPS format)
r; t=0.04 8:27:41

. r; t=1.38 8:27:41
. `fddad3440dac2fce74853059374143f5'
r; t=0.00 8:27:41
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:41

. local `__user_rc' = _rc
r; t=0.00 8:27:41

. r; t=0.00 8:27:41
r; t=0.00 8:27:41
r; t=0.00 8:27:41

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:41
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:41

. macro drop _`__user_rc'
r; t=0.00 8:27:41

. macro drop ___user_rc
r; t=0.00 8:27:41

. r; t=0.00 8:27:41
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:41
. include /Users/miguelportela/.stata_kernel_cache/include.do

. encode country,ge(cty_id)
r; t=0.00 8:27:42

. xtset cty_id year
       panel variable:  cty_id (unbalanced)
        time variable:  year, 1950 to 2000, but with gaps
                delta:  1 unit
r; t=0.01 8:27:42

. reg lngdp education

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(1, 855)       =   1173.23
       Model |  713.696014         1  713.696014   Prob > F        =    0.0000
    Residual |  520.110021       855  .608315814   R-squared       =    0.5785
-------------+----------------------------------   Adj R-squared   =    0.5780
       Total |  1233.80604       856  1.44136219   Root MSE        =    .77995

------------------------------------------------------------------------------
       lngdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   education |   .3168632   .0092508    34.25   0.000     .2987062    .3350201
       _cons |   7.791869   .0515379   151.19   0.000     7.690714    7.893025
------------------------------------------------------------------------------
r; t=0.10 8:27:42

. estimates store r1
r; t=0.00 8:27:42

. reg lngdp education lnk

      Source |       SS           df       MS      Number of obs   =       234
-------------+----------------------------------   F(2, 231)       =    133.37
       Model |  131.889596         2  65.9447979   Prob > F        =    0.0000
    Residual |    114.2209       231  .494462771   R-squared       =    0.5359
-------------+----------------------------------   Adj R-squared   =    0.5319
       Total |  246.110496       233  1.05626822   Root MSE        =    .70318

------------------------------------------------------------------------------
       lngdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   education |   .2116552   .0201276    10.52   0.000     .1719981    .2513123
         lnk |   .1246923   .0290613     4.29   0.000     .0674333    .1819514
       _cons |   5.408527   .6765897     7.99   0.000     4.075451    6.741602
------------------------------------------------------------------------------
r; t=0.01 8:27:42

. est store r2
r; t=0.00 8:27:42

. reg lngdp education lnk openk i.year 

      Source |       SS           df       MS      Number of obs   =       234
-------------+----------------------------------   F(7, 226)       =     46.99
       Model |  145.879747         7  20.8399639   Prob > F        =    0.0000
    Residual |  100.230749       226  .443498888   R-squared       =    0.5927
-------------+----------------------------------   Adj R-squared   =    0.5801
       Total |  246.110496       233  1.05626822   Root MSE        =    .66596

------------------------------------------------------------------------------
       lngdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   education |   .2136664   .0193553    11.04   0.000     .1755265    .2518063
         lnk |   .1978085   .0308039     6.42   0.000     .1371089    .2585082
       openk |   .0062439   .0011852     5.27   0.000     .0039085    .0085794
             |
        year |
       1975  |  -.0694608   .1387178    -0.50   0.617    -.3428064    .2038849
       1980  |   -.177992   .1401702    -1.27   0.205    -.4541996    .0982156
       1985  |  -.2226975   .1400607    -1.59   0.113    -.4986894    .0532943
       1990  |    -.34965   .1425169    -2.45   0.015    -.6304819   -.0688182
             |
       _cons |    3.38917   .7508785     4.51   0.000     1.909552    4.868789
------------------------------------------------------------------------------
r; t=0.07 8:27:42

. est store r3
r; t=0.00 8:27:42

. xtreg lngdp education lnk openk i.year, fe

Fixed-effects (within) regression               Number of obs     =        234
Group variable: cty_id                          Number of groups  =         47

R-sq:                                           Obs per group:
     within  = 0.4750                                         min =          4
     between = 0.2234                                         avg =        5.0
     overall = 0.2300                                         max =          5

                                                F(7,180)          =      23.27
corr(u_i, Xb)  = 0.0241                         Prob > F          =     0.0000

------------------------------------------------------------------------------
       lngdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   education |  -.0113011   .0287179    -0.39   0.694    -.0679681    .0453659
         lnk |    .222327   .0363131     6.12   0.000     .1506729    .2939812
       openk |  -.0023212   .0005905    -3.93   0.000    -.0034864    -.001156
             |
        year |
       1975  |     .00481    .033754     0.14   0.887    -.0617944    .0714144
       1980  |   .0490685   .0462883     1.06   0.291     -.042269    .1404061
       1985  |   .0837488   .0482533     1.74   0.084    -.0114661    .1789637
       1990  |   .0833845    .061401     1.36   0.176    -.0377738    .2045428
             |
       _cons |   4.272374   .8685588     4.92   0.000     2.558507    5.986241
-------------+----------------------------------------------------------------
     sigma_u |  .90169015
     sigma_e |  .13620051
         rho |  .97769279   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(46, 180) = 113.55                   Prob > F = 0.0000
r; t=0.13 8:27:42

. est store fe
r; t=0.00 8:27:42

. xtreg lngdp education lnk openk i.year, be
note: 1980.year omitted because of collinearity
note: 1985.year omitted because of collinearity
note: 1990.year omitted because of collinearity

Between regression (regression on group means)  Number of obs     =        234
Group variable: cty_id                          Number of groups  =         47

R-sq:                                           Obs per group:
     within  = 0.0325                                         min =          4
     between = 0.6294                                         avg =        5.0
     overall = 0.0212                                         max =          5

                                                F(4,42)           =      17.84
sd(u_i + avg(e_i.))=  .6516239                  Prob > F          =     0.0000

------------------------------------------------------------------------------
       lngdp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   education |   .2090783   .0436713     4.79   0.000     .1209462    .2972105
         lnk |   .2294874   .0712328     3.22   0.002     .0857338    .3732411
       openk |   .0085959   .0029256     2.94   0.005     .0026918       .0145
             |
        year |
       1975  |  -13.04727    13.7101    -0.95   0.347    -40.71536    14.62082
       1980  |          0  (omitted)
       1985  |          0  (omitted)
       1990  |          0  (omitted)
             |
       _cons |   4.948032   2.998657     1.65   0.106    -1.103502    10.99957
------------------------------------------------------------------------------
r; t=0.13 8:27:42

. est store be
r; t=0.00 8:27:42

. xtreg lngdp education lnk openk i.year,re

Random-effects GLS regression                   Number of obs     =        234
Group variable: cty_id                          Number of groups  =         47

R-sq:                                           Obs per group:
     within  = 0.4538                                         min =          4
     between = 0.3963                                         avg =        5.0
     overall = 0.3965                                         max =          5

                                                Wald chi2(7)      =     175.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0000

------------------------------------------------------------------------------
       lngdp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   education |   .0643836    .024905     2.59   0.010     .0155706    .1131966
         lnk |   .2065643   .0327617     6.31   0.000     .1423525    .2707762
       openk |  -.0019678   .0006047    -3.25   0.001     -.003153   -.0007825
             |
        year |
       1975  |  -.0151684   .0338323    -0.45   0.654    -.0814785    .0511418
       1980  |  -.0140967   .0424745    -0.33   0.740    -.0973452    .0691518
       1985  |  -.0054882   .0438514    -0.13   0.900    -.0914354     .080459
       1990  |  -.0360118   .0537253    -0.67   0.503    -.1413115    .0692879
             |
       _cons |   4.283655   .7788556     5.50   0.000     2.757126    5.810184
-------------+----------------------------------------------------------------
     sigma_u |  .64875565
     sigma_e |  .13620051
         rho |  .95778533   (fraction of variance due to u_i)
------------------------------------------------------------------------------
r; t=0.14 8:27:42

. est store re
r; t=0.00 8:27:42

. r; t=0.63 8:27:42
. `4d14ce6822fef64c7b3820ddd48865a9'
r; t=0.00 8:27:42
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:42

. local `__user_rc' = _rc
r; t=0.00 8:27:42

. r; t=0.00 8:27:42
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:42
r; t=0.00 8:27:42

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:42
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:42

. macro drop _`__user_rc'
r; t=0.00 8:27:42

. macro drop ___user_rc
r; t=0.00 8:27:42

. r; t=0.00 8:27:42
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:42
. include /Users/miguelportela/.stata_kernel_cache/include.do

. outreg, clear
r; t=0.10 8:27:42

. estimates restore r1
(results r1 are active now)
r; t=0.00 8:27:42

. outreg using ../text/growth_analysis, replace rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons)  ctitle("","Simple model")  nodisplay varlabels bdec(3) se starlevels(10 5 1) starloc(1) summstat(r2\rmse \ N) summtitle("R2"
> \"RMSE" \ "N")
r; t=0.16 8:27:43

. estimates restore r2
(results r2 are active now)
r; t=0.00 8:27:43

. outreg using ../text/growth_analysis, merge rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons)  ctitle("","Include capital")  nodisplay varlabels bdec(4) se starlevels(10 5 1) starloc(1) summstat(r2\rmse \ N) summtitle("R2
> "\"RMSE" \ "N")
r; t=0.00 8:27:43

. estimates restore r3
(results r3 are active now)
r; t=0.01 8:27:43

. outreg using ../text/growth_analysis, merge rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons 1975.year 1980.year 1985.year 1990.year)  ctitle("","Full model")  varlabels bdec(4) se starlevels(10 5 1) starloc(1) summstat(r
> 2\rmse \ N) summtitle("R2"\"RMSE" \ "N")

                                                                                                --------------------------------------------------------------
                                                                                                                   Simple model  Include capital  Full model 
                                                                                                --------------------------------------------------------------
                                                                                                 Education           0.317***       0.2117***     0.2137***  
                                                                                                                     (0.009)        (0.0201)       (0.0194)  
                                                                                                 Capital                            0.1247***     0.1978***  
                                                                                                                                    (0.0291)       (0.0308)  
                                                                                                 Openness degree                                  0.0062***  
                                                                                                                                                   (0.0012)  
                                                                                                 R2                    0.58           0.54           0.59    
                                                                                                 RMSE                  0.78           0.70           0.67    
                                                                                                 N                     857             234           234     
                                                                                                --------------------------------------------------------------
                                                                                                                * p<0.1; ** p<0.05; *** p<0.01

r; t=0.01 8:27:43

. r; t=0.30 8:27:43
. `052930a186d2797ef2460e592c0cda49'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:43

. local `__user_rc' = _rc
r; t=0.00 8:27:43

. r; t=0.00 8:27:43
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:43
r; t=0.00 8:27:43

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:43

. macro drop _`__user_rc'
r; t=0.00 8:27:43

. macro drop ___user_rc
r; t=0.00 8:27:43

. r; t=0.00 8:27:43
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:43
. esttab r1 r2 r3 fe re using ../text/growth_analysis_esttab.doc, replace keep(education lnk openk) mtitle("Model # 1" "Model (2)" "Model (3)") nonumbers coeflabel (education "Average education" lnk "Log capital" openk "Openness") b(%5.3f) se(%5.3f) sfmt(
> %5.2f) star(* 0.1 ** 0.05 *** 0.01) scalars("N Observations" "r2 R$^2$" "rmse RMSE") nonotes addnotes("Notes: standard errors in parenthesis. Significance levels: *, 10\%;" "**, 5\%; ***, 1\%. The dependent variable is ln real GDP per workers." "Source:
>  own computations.")
(output written to ../text/growth_analysis_esttab.doc)
r; t=0.07 8:27:43

. `6f5678534e8f9709128fd976bbc0649d'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:43

. local `__user_rc' = _rc
r; t=0.00 8:27:43

. r; t=0.00 8:27:43
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:43
r; t=0.00 8:27:43

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:43

. macro drop _`__user_rc'
r; t=0.00 8:27:43

. macro drop ___user_rc
r; t=0.00 8:27:43

. r; t=0.00 8:27:43
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:43
. esttab r1 r2 r3 fe be re using ../text/growth_analysis_esttab.tex, replace keep(education lnk openk) mtitle("OLS (1)" "OLS (2)" "OLS (3)" "FE" "BE" "RE") nonumbers coeflabel (education "Average education" lnk "Log capital" openk "Openness") b(%5.3f) se(
> %5.3f) sfmt(%7.2f) star(* 0.1 ** 0.05 *** 0.01) scalars("N Observations" "r2 R$^2$" "rmse RMSE") nonotes addnotes("Notes: standard errors in parenthesis. Significance levels: *, 10\%; **, 5\%; ***, 1\%." "The dependent variable is ln real GDP per worker
> . All models include a constant." "Models OLS (3) till RE include time dummies." "Source: own computations.")
(output written to ../text/growth_analysis_esttab.tex)
r; t=0.07 8:27:43

. `df525a88613580d53cfb2570dba7da76'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:43

. local `__user_rc' = _rc
r; t=0.00 8:27:43

. r; t=0.00 8:27:43
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:43
r; t=0.00 8:27:43

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:43

. macro drop _`__user_rc'
r; t=0.00 8:27:43

. macro drop ___user_rc
r; t=0.00 8:27:43

. r; t=0.00 8:27:43
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. outreg, clear
r; t=0.00 8:27:43

. estimates restore r1
(results r1 are active now)
r; t=0.00 8:27:43

. outreg using ../text/growth_analysis_frag, tex fragment replace rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons)  ctitle("","Simple model")  nodisplay varlabels bdec(4) se starlevels(10 5 1) starloc(1) summstat(r2\rmse \
>  N) summtitle("R2"\"RMSE" \ "N")
r; t=0.00 8:27:43

. estimates restore r2
(results r2 are active now)
r; t=0.02 8:27:43

. outreg using ../text/growth_analysis_frag, tex fragment merge rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons)  ctitle("","Include capital")  nodisplay varlabels bdec(3) se starlevels(10 5 1) starloc(1) summstat(r2\rmse 
> \ N) summtitle("R2"\"RMSE" \ "N")
r; t=0.00 8:27:43

. estimates restore r3
(results r3 are active now)
r; t=0.01 8:27:43

. outreg using ../text/growth_analysis_frag, tex fragment merge rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons 1975.year 1980.year 1985.year 1990.year)  ctitle("","Full model")  nodisplay varlabels bdec(1) se starlevels(1
> 0 5 1) starloc(1) summstat(r2\rmse \ N) summtitle("R2"\"RMSE" \ "N")
r; t=0.00 8:27:43

. r; t=0.05 8:27:43
. `85623112d0a5ed825be29414605a4dea'
r; t=0.00 8:27:43
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:44

. local `__user_rc' = _rc
r; t=0.00 8:27:44

. r; t=0.00 8:27:44
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:44
r; t=0.00 8:27:44

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:44
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:44

. macro drop _`__user_rc'
r; t=0.00 8:27:44

. macro drop ___user_rc
r; t=0.00 8:27:44

. r; t=0.00 8:27:44
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:44
. include /Users/miguelportela/.stata_kernel_cache/include.do

. outreg, clear
r; t=0.00 8:27:44

. estimates restore r1
(results r1 are active now)
r; t=0.00 8:27:44

. outreg using ../text/growth_analysis, tex replace rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons)  ctitle("","Simple model")  nodisplay varlabels bdec(4) se starlevels(10 5 1) starloc(1) summstat(r2\rmse \ N) summtitle(
> "R2"\"RMSE" \ "N")
r; t=0.00 8:27:44

. estimates restore r2
(results r2 are active now)
r; t=0.00 8:27:44

. outreg using ../text/growth_analysis, tex merge rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons)  ctitle("","Include capital")  nodisplay varlabels bdec(4) se starlevels(10 5 1) starloc(1) summstat(r2\rmse \ N) summtitle
> ("R2"\"RMSE" \ "N")
r; t=0.00 8:27:44

. estimates restore r3
(results r3 are active now)
r; t=0.00 8:27:44

. outreg using ../text/growth_analysis, tex merge rtitles("Education" \ "" \ "Capital" \ "" \ "Openness degree" \ "")   drop(_cons 1975.year 1980.year 1985.year 1990.year)  ctitle("","Full model")  nodisplay varlabels bdec(4) se starlevels(10 5 1) starloc
> (1) summstat(r2\rmse \ N) summtitle("R2"\"RMSE" \ "N")
r; t=0.01 8:27:44

. r; t=0.02 8:27:44
. `f0511e79c92a50424475e8b1241aa9b4'
r; t=0.00 8:27:44
. include /Users/miguelportela/.stata_kernel_cache/include.do

. tempname __user_rc
r; t=0.00 8:27:44

. local `__user_rc' = _rc
r; t=0.00 8:27:44

. r; t=0.00 8:27:44
. `cc64df03024327541235dabb93f09e00'
r; t=0.00 8:27:44
r; t=0.00 8:27:44

. `d450cfde56d6cad2042c8f0870cc76f5'
r; t=0.00 8:27:44
. include /Users/miguelportela/.stata_kernel_cache/include.do

. _StataKernelResetRC, num(``__user_rc'')
r; t=0.00 8:27:44

. macro drop _`__user_rc'
r; t=0.00 8:27:44

. macro drop ___user_rc
r; t=0.00 8:27:44

. r; t=0.00 8:27:44
. `d1d0b5544eadcba44c5f1aa5695588da'
r; t=0.00 8:27:44
. include /Users/miguelportela/.stata_kernel_cache/include.do

. timer off 1
r; t=0.00 8:27:44

. timer list 1
r; t=0.00 8:27:44

. log close
      name:  <unnamed>
       log:  /Users/miguelportela/Dropbox/1.miguel/1.formacao/jupyter/stata_full_exercise/logs/exercise_complete_output.txt
  log type:  text
 closed on:  17 Feb 2020, 08:27:44
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
